Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/younger_jobseekers.html.txt.tmx
Source language: en
Languages: ga

source: Information for younger jobseekers
ga: Faisnéis do chuardaitheoirí poist óga

source: Young people must meet the same conditions as other jobseekers to get a jobseeker's payment but they may need targeted supports to help them enter the workforce
ga: Caithfidh cuardaitheoir poist óga comhlíonadh a dhéanamh ar na coinníollacha céanna nach mór do chuardaitheoirí eile poist iad a chomhlíonadh chun íocaíocht cuardaitheora poist a fháil ach d’fhéadfadh go mbeadh tacaí spriocdhírithe ag teastáil uathu chun cabhrú leo dul isteach san fhórsa oibre

source: A Youth Guarantee is being introduced (see below) that will support all young jobseekers and give them access to training, education, work experience or full-time employment
ga: Tá Ráthaíocht don Aos Óg á tabhairt isteach (féach thíos), rud a thacóidh le cuardaitheoirí poist óga agus a thabharfaidh rochtain dóibh ar oiliúint, ar an oideachas, ar thaithí oibre agus ar fhostaíocht lánaimseartha

source: If you have just left school you cannot get Jobseeker's Allowance
ga: Más rud é go bhfuil tú díreach tar éis an scoil a fhágáil, ní fhéadfaidh tú Liúntas Cuardaitheora Poist a fháil

source: To get Jobseeker's Allowance you must have been out of school for 3 months and you must be at least 18 years of age
ga: D'fhonn Liúntas Cuardaitheora Poist a fháil, caithfidh go bhfuil tú as an scoil ar feadh 3 mhí ar a laghad agus go bhfuil tú 18 mbliana d'aois ar a laghad

source: The 3-month period starts from the day you leave school or the day following your last exam if you are doing exams
ga: Tosaíonn an tréimhse 3 mhí ón lá ar a bhfágann tú an scoil nó ón lá tar éis do scrúdaithe deiridh má tá scrúduithe á ndéanamh agat

source: People aged under 26 who do not have children get a reduced rate of Jobseeker's Allowance
ga: Faigheann daoine atá faoi bhun 26 bliain d'aois nach bhfuil leanaí acu ráta laghdaithe Liúntas Cuardaitheora Poist

source: If they take up a place on an education, training or work experience scheme they will get a higher rate of payment
ga: Má ghlacann siad le háit ar chúrsa oideachais, ar chúrsa oiliúna nó ar scéim taithí oibre, gheobhaidh siad ráta níos airde íocaíochta

source: You can visit our documents on education and training options and on employment support schemes to get more information on the rates paid
ga: Is féidir leat dul chuig ár gcáipéisí ar roghanna oideachais agus oiliúna agus ar scéimeanna tacaíocht fostaíochta chun tuilleadh faisnéise ar na rátaí a íoctar a fháil

source: Maximum rate of JA for people under 26 without children (from 8 March 2017)
ga: An t-uasráta Liúntas Cuardaitheora Poist do dhaoine faoi bhun 26 bliain d'aois nach

source: │Age │Personal rate │Increase for a qualified adult │
ga: │Aois │Ráta pearsanta │Méadú d'aosach cáilitheach │

source: The reduced personal and qualified adult rates of Jobseeker’s Allowance (JA) for people under 26 do not apply to:
ga: I gcás daoine faoi bhun 26 bliain d'aois, níl feidhm ag na rátaí laghdaithe pearsanta Liúntas Cuardaitheora Poist ná ag na rátaí laghdaithe Liúntas Cuardaitheora Poist d'aosaigh cháilithe maidir leis na daoine seo a leanas:

source: • People with dependent children
ga: • Daoine a bhfuil leanaí cleithiúnacha acu

source: • People transferring from Disability Allowance to JA
ga: • Daoine atá ag aistriú ó Liúntas Míchumais go Liúntas Cuardaitheora Poist

source: • People aged 22-25 who were getting a higher rate before 15 January 2014
ga: • Daoine atá 22-25 bliain d'aois agus a bhí ag fáil ráta níos airde roimh an 15 Eanáir 2014

source: • People whose claim is linked to a previous JA claim made within the previous 12 months to which the maximum personal rate applied
ga: • Daoine a bhfuil a n-éileamh nasctha le héileamh roimhe ar Liúntas Cuardaitheora Poist a rinneadh laistigh den 12 mhí ina raibh feidhm ag an ráta pearsanta uasta

source: • Certain children who were in the care of the HSE during the 12 months before reaching 18
ga: • Leanaí áirithe a bhí faoi chúram FSS le linn an 12 mhí sular bhain siad 18 mbliana amach

source: These people are assessed using the JA rate for people aged 26 or over
ga: Déantar na daoine sin a mheasúnú trí leas a bhaint as an ráta Liúntas Cuardaitheora Poist atá i bhfeidhm do dhaoine atá 26 bliain d'aois nó níos sine

source: This exception only applies between the ages of 18 and 24
ga: Níl an eisceacht sin i bhfeidhm ach amháin i gcás daoine atá idir 18 mbliana d'aois agus 24 bliain d'aois

source: From the age of 25, the age-related rate applies
ga: Tá feidhm ag an ráta aoischoibhneasa i gcás daoine atá 25 bliain d'aois nó níos sine

source: If you were getting an age-related reduced rate of JA and you take part in a course of education or training or an employment scheme the reduced personal rate of payment applicable to that course or scheme will apply as long as you are aged under 26
ga: Más rud é go raibh tú ag fáil ráta aoischoibheasa laghdaithe Liúntas Cuardaitheora Poist agus go nglacann tú páirt i gcúrsa oideachais, i gcúrsa oiliúna nó i scéim tacaíocht fostaíochta, beidh feidhm ag an ráta pearsanta laghdaithe íocaíochta maidir leis an gcúrsa nó leis an scéim sin fad is atá tú faoi bhun 26 bliain d'aois

source: When you complete the course you will revert to your previous age-related JA rate
ga: Nuair a bheidh an cúrsa críochnaithe agat, fillfidh tú ar an ráta aoischoibhneasa Liúntas Cuardaitheora Poist a fuair tú roimhe

source: You must have at least 104 social insurance contributions (2 years) to qualify for Jobseeker’s Benefit (JB)
ga: Caithfidh go bhfuil 104 ranníocaíocht árachais shóisialaigh agat (2 bhliain) chun cáiliú le haghaidh Sochar Cuardaitheora Poist

source: This means that many young people do not qualify for Jobseeker’s Benefit if they lose their job or cannot find employment
ga: Ciallaíonn sé sin nach gcáileoidh roinnt mhaith daoine óga le haghaidh Sochar Cuardaitheora Poist más rud é go gcailleann siad a bpost nó nach féidir leo fostaíocht a fháil

source: If you worked part-time during school or college you may have enough PRSI contributions to qualify for JB but if your average weekly earnings were below €300 you may only qualify for a lower rate of JB
ga: Má d'oibrigh tú go páirtaimseartha le linn na scoile nó an choláiste, is féidir go mbeidh go leor ranníocaíochtaí ÁSPC agat chun cáiliú le haghaidh Sochar Cuardaitheora Poist

source: Third-level students cannot claim Jobseeker's Allowance or Benefit while they are studying full-time
ga: Ní féidir le mic léinn tríú leibhéil Liúntas Cuardaitheora Poist ná Sochar Cuardaitheora Poist a éileamh agus iad ag staidéar go lánaimseartha

source: This disqualification also applies to the summer holiday periods between academic years (unless you are a mature student or are getting a Back to Education Allowance)
ga: Tá feidhm ag an dícháiliú sin maidir leis na tréimhsí saoire samhraidh idir blianta acadúla (mura mac léinn lánfhásta thú)

source: However once you have finished college permanently you can claim a jobseeker's payment if you cannot find work
ga: Féadfaidh tú íocaíocht cuardaitheora poist a éileamh a luaithe is a chríochnaíonn tú an coláiste go buan, áfach, mura féidir leat obair a fháil

source: This is also the case if you leave college without finishing your course
ga: Tá sé amhlaidh freisin má fhágann tú an coláiste gan do chúrsa a chur i gcrích

source: You may be able to claim a jobseeker’s payment while you are working on a project or research thesis if you are available for work during this time
ga: Is féidir go mbeidh tú ábalta íocaíocht cuardaitheora poist a éileamh agus tú ag obair ar thionscadal nó ar thráchtas taighde má tá tú ar fáil i gcomhair oibre le linn na tréimhse sin

source: Student credits may help you to qualify for Jobseeker's Benefit
ga: Is féidir go gcabhróidh creidmheasanna mac léinn leat cáiliú le haghaidh Sochar Cuardaitheora Poist

source: They are awarded where you were a full-time student during the relevant tax year and had paid contributions before going to college or during the period spent at college
ga: Bronntar iad sa chás go raibh tú i do mhac léinn lánaimseartha le linn na bliana cánach ábhartha agus gur íoc tú ranníocaíochtaí sula ndeachaigh tú chun an choláiste nó le linn na tréimhse a chaith tú ag an gcoláiste

source: You must have paid contributions at Class A, have started full-time education before 23 years of age and have re-entered insurable employment after the course has ceased
ga: Caithfidh gur íoc tú ranníocaíochtaí ag Aicme A, gur thosaigh tú oideachas lánaimseartha sula raibh tú 23 bliain d'aois agus go ndeachaigh tú isteach i bhfostaíocht inárachaithe an athuair sula raibh an cúrsa críochnaithe

source: Student credits can only be awarded only once
ga: Ní féidir creidmheasanna mac léinn a bhronnadh ach uair amháin

source: Back to Education Allowance
ga: An Liúntas chun Filleadh ar an Oideachas

source: From 1 January 2014 all new Back to Education Allowance (BTEA) participants aged under 26 who were getting a reduced age-related Jobseeker’s Allowance payment, will get a maximum BTEA rate of €160 per week (increasing to €193 from September 2017)
ga: Gach rannpháirtí nua sa Liúntas chun Filleadh ar an Oideachas (BTEA) atá faoi bhun 26 bliain d'aois agus a bhí ag fáil íocaíocht aoischoibhneasa laghdaithe Liúntas Cuardaitheora Poist, gheobhaidh siad ráta uasta BTEA de ?

source: Any means participants have will be deducted from this rate
ga: 160 in aghaidh na seachtaine ón 1 Eanáir 2014 (bainfear aon acmhainn atá ag rannpháirtithe ón ráta sin)

source: If you have been getting the Back to Education Allowance during your second-level studies you can claim JA immediately
ga: Más rud é go raibh tú ag fáil an Liúntais chun Filleadh ar an Oideachas le linn do staidéir dara leibhéal, féadfaidh tú Liúntas Cuardaitheora Poist a éileamh lom láithreach

source: The Youth Guarantee aims to provide young people under the age of 25 with a good quality offer of employment, education, training or apprenticeship within a short time of leaving education or becoming unemployed
ga: Is é is aidhm don Ráthaíocht don Aos Óg tairiscint mhaith fostaíochta, oideachais, oiliúna nó printíseachta a chur ar fáil do dhaoine óga faoi bhun 25 bliain d'aois laistigh de thréimhse ghairid tar éis dóibh an t-oideachas a fhágáil nó éirí dífhostaithe

source: It is an EU initiative developed in response to the youth unemployment crisis
ga: Is tionscnamh AE é a forbraíodh mar fhreagairt don ghéarchéim óg-dhífhostaíochta

source: Across the EU, an estimated 7.5 million young people aged 15-24 are not employed, not in education and not in training
ga: Meastar go bhfuil 7.5 milliún duine óg idir 15-24 bliain d'aois ar fud an AE nach bhfuil fostaithe, i mbun oideachais ná i mbun oiliúna

source: In Ireland, the Guarantee will be introduced on a phased basis (pdf)
ga: In Éirinn, tabharfar an Ráthaíocht isteach ar bhonn céimnithe (pdf)

source: By the end of 2015:
ga: Faoi dheireadh na bliana 2015:

source: • Young people under 18 who have left the school system without completing secondary education and who are unemployed will be given a ‘second chance’ education pathway such as Youthreach or will be supported to re-enter the school system
ga: • Tabharfar bealach oideachais 'athdheise' amhail Ógtheagmháil do dhaoine óga faoi bhun 18 mbliana d'aois a d'fhág an córas scoile gan meánoideachas a chríochnú agus atá dífhostaithe nó tabharfar tacaíocht dóibh dul isteach sa chóras scoile an athuair

source: • Young people aged 18-24 who have been unemployed for 4 months will get help to find work or will get an offer of quality training, education or work experience
ga: • Gheobhaidh daoine óga idir 18-24 bliain d'aois atá dífhostaithe ar feadh 4 mhí cabhair chun obair a fháil nó gheobhaidh siad tairiscint oiliúna, oideachais nó taithí oibre ardchaighdeáin

source: Currently a pilot Youth Guarantee project is underway in Ballymun
ga: Tá tionscadal píolótach um an Ráthaíocht don Aos Óg ar bun i mBaile Munna faoi láthair

source: You can visit youthguarantee.ie to find out more about this pilot scheme
ga: Is féidir leat dul chuig youthguarantee.ie chun tuilleadh faisnéise a fháil faoin scéim phíolótach sin

source: Under the Youth Guarantee a range of initiatives are being put in place
ga: Cá háit a ndéanfaidh mé iarratas

source: You apply for Jobseeker's Benefit or Jobseeker's Allowance to your Intreo centre or social welfare local office
ga: Déanann tú iarratas ar Shochar Cuardaitheora Poist nó ar Liúntas Cuardaitheora in ionad áitiúil Intreo nó i d'oifig áitiúil leasa shóisialaigh
